Tekla Open API Reference for Tekla Structures 2025
AnalysisObject.ID Property
 Gets or sets the identifier of the analysis object.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier ID { get; set; }
Public Property ID As Identifier
	Get
	Set
Property Value
Type: Identifier
See Also
Reference
AnalysisObject Class
Tekla.Structures.Analysis Namespace